package test

import (
	"fmt"
	"github.com/KercyLAN/dev-kits/components/hanzi/pinyin"
	"testing"
)

var datas = []string{"郝译晨","化诗然","蒋心悦","李雨露","刘馨澜","吕蒋泠","吴恩琪","许雯珈","叶邵铭心","章佳蕴","赵诗筠","安攀颉","曹源","陈天瑞","陈子桐","樊哲宇","郭令","黄溢珩","居佳程","孔梦同","李卓原","刘皓翔","刘笑辰","刘赟炜","刘宗翰","倪潇然","潘俊名","潘彦璋","秦朗","施季安","孙译晨","童嘉祺","王仁杰","王栩珩","王雪丞","王一童","危子增","徐嘉翔","许越凡","杨曜瑜","杨育宁","于博为","张宸熙","张思远","赵懿嘉","周中泽","陈博雅","陈嘉仪","陈墨琳","陈望舒","程昕怡","戴心怡","冯奕菲","高艺菡","耿子涵","黄嘉怡","蒋琬菁","刘璐菲","陆文婧","石嘉旖","史悦霖","唐知怿","王雨阳","吴俽竹","张学菡","赵思颖","陈睿远","陈钇羽","郭添翼","郭雨翀","贺仁杰","金鼎渊","李大晟","刘扬帆","潘俊恺","任重源","荣毅宸","石宇恒","孙涵","孙佳一","汤瑞楷","王贤佑","王严涛","吴荣淳","许子凌","应子弘","俞正豪","臧乐翔","张瑞麒","张淯宸","朱奥齐","朱振宇","蔡静仪","陈淑菱","陈玥婷","侯榕榕","黄韵文","蔺雨诺","陆榆","陆昱彤","罗雅微","杨淇越","张家淇","张琪","张玘瑄","张奕阳","赵睿齐","周熠薇","邹馨锐","陈澄","邓澄","丁亦凡","杜博成","樊佳琛","樊吴昊","黄艺博","黄宇澄","黄梓","刘皓泽","刘嘉瑞","陆皓天","罗宸昊","庞博","童暄泽","王海悦","王宇轩","吴可凡","吴致宇","徐内奇","薛钰衎","张子宸","周可扬","范韵娴","范姿妤","冯庭瑄","吉子悦","康紫珺","李若水","刘佳萱","芦清然","陆炘辰","陆颍轩","孟繁娜","宋安然","宋天阳","孙心悦","肖馨妤","俞悦","赵紫陌","钟安祺","周歆悦","朱可妡","程方瑞","戴正哲","邓思睿","侯天彻","胡钧羿","华卿睿","孔庆东","李昊宸","李茂瑄","李张扬","李振翔","刘嘉远","刘梦临","吕橦","闵璋齐","潘智宇","施程栋","王辰玄","王锦泰","王欣程","翁子涵","业皓展","余音","张劲涵","张睿齐","张振轩","赵涵宇","朱屹涵","蔡君彦","陈海严","柯依澄","刘宇馨","刘羽昕","浦启敏","曲笑熠","帅雨嘉","孙启然","孙杨璨","涂诗婳","夏睿仪","徐悦诗","易雯悦","袁昕熠","张家琪","赵方菲","郑语含","朱燕曦","曹皓瑄","车子浩","陈金地","陈君豪","陈奕天","迟誉朗","丁朗清","富思超","葛俊浩","胡子轩","李浩宇","刘树一","刘兆祺","吕睿恒","汪孜宁","项正元","叶杨霏","殷子建","赵浩宇","赵延华","左昊轩","程显然","董阳乐","何思仪","何欣雨","姜其含","雷安","刘璐瑶","马言冰","裴一涵","苏辰","吴若凡","徐小卜","许晴","张源倬","张远琦","张知之","赵雅言","钟瑞芝","蔡霆凯","郭恺文","胡凯枫","黄芸朗","金辰宇","李家齐","刘屹泽","禄承熹","钱浩轩","上官云柯","邵嘉玮","史家旋","宋天一","吴攸","肖景行","许林奕","许余行","杨一帆","张珈瑞","张蕴韬","张展驰","赵轩","陈李玥","程诗颖","方子悦","冯煜栖","顾佳颐","简小西","姜涵曦","李歆玥","林乐怡","刘信庭","汤嘉霓","徐心怡","杨依凡","印舒妤","张芷涵","赵芷铱","周诗怡","朱汐雯","施亦涵","陈思成","高彦泽","黄济凌","黄子辰","纪畅远","纪德能","李冠良","李品衡","李锐驰","梁新智","凌哲维","刘佳骐","孙嘉荣","唐子昂","滕子涵","童非","屠颢洋","吴一凡","徐晟元","许景涵","燕怀瑾","杨济安","张裕成","赵宇轩","郑思洵","周宬俣","周业翔","周致宏","董洺铭","姜林蔚","李怡婷","廖若铭","林诗芸","刘珈妤","钮悦","沙亦炜","申沐晗","沈天齐","王晨","王馥茗","许悦琳","姚玮辰","张飞扬","郑懿轩","周可洋","周晴怡","曹子诚","陈习","戴陈安","金家萱","李嘉宁","李明睿","刘兮尧","茅智远","邵彦凯","邵子硕","沈秱","宋宇民","宋元坤","孙业恒","万子睿","王润锴","王思为","肖逸轩","徐稼轩","许一诺","许张弛","姚嘉佑","姚舜","张家诚","周裕斌","周孜桓","朱亦成","邹一鸣","侯轶哲","程欣雅","杜晓阳","范怡萱","葛子安","顾子萱","黄渲婷","柯艺婷","李涵璐","李欣宇","李奕含","刘铭钰","卢乐贤","吕奕潼","宋宇凡","汤羿萱","许乐扬","杨海笑","杨译涵","张芷晗","仲祺筠","祝语晨","丁振洪","顾鎏","何为","黄天嘉","金奕多","李浩佳","刘槿轩","陆笑扬","明奕辰","乔瑀","田宇翔","王承宇","王韬源","王泽亚","吴奕唯","武东和","薛杰森","颜学衡","杨彦超","张飞扬","张智程","张智铭","周涵宇","周世博","周宇轩","方依苒","高子寒","胡菲扬","黄艺欣","李思睿","李玥霖","李郑妮","刘婧涵","彭珈悦","仇新然","王靖雯","吴思语","徐一壹","许怡然","薛景畅","于卓凡","张小晗","朱馨蕊","胡坤锦","韩正阳","黄宇涵","金宏浩","李泽霖","刘宇程","刘云舸","彭焱飞","彭子超","商量","申奇函","施宇洲","史家凯","孙宇辰","王博奕","王昕羽","王雅涛","王元赛","王子墨","杨利辰","姚和舜","张泰铭","张子歆"}

func TestData(t *testing.T)  {
	for _, data := range datas {
		pys := pinyin.Gains(data)
		for _, py := range pys {
			fmt.Print(py.String())
		}
		fmt.Println()
	}
}

func TestGain(t *testing.T) {
	py := pinyin.Gain("你好")
	t.Log("source：",py.Source())
	t.Log("initial：",py.Initial())
	t.Log("finals：",py.Finals())
	t.Log("tone：",py.Tone())
	t.Log("string：",py.String())
	t.Log("stringTone：",py.StringTone())
	t.Log("error：",py.Err())
	t.Log("----------------------------------")
	py2 := pinyin.Gain("你")
	t.Log("source：",py2.Source())
	t.Log("initial：",py2.Initial())
	t.Log("finals：",py2.Finals())
	t.Log("tone：",py2.Tone())
	t.Log("string：",py2.String())
	t.Log("stringTone：",py2.StringTone())
	t.Log("error：",py2.Err())
}

func TestGains(t *testing.T) {
	pinyins := pinyin.Gains("你好")
	for _, py := range pinyins {
		t.Log("source：",py.Source())
		t.Log("initial：",py.Initial())
		t.Log("finals：",py.Finals())
		t.Log("tone：",py.Tone())
		t.Log("string：",py.String())
		t.Log("stringTone：",py.StringTone())
		t.Log("error：",py.Err())
		t.Log("----------------------------------")
	}
}

func TestToString(t *testing.T) {
	pinyins := pinyin.Gains("你好噢")
	t.Log(pinyin.ToString(pinyins, ""))
	t.Log(pinyin.ToString(pinyins))
	t.Log(pinyin.ToString(pinyins, ","))
	t.Log(pinyin.ToString(pinyins, "-"))
}

func TestToStringTone(t *testing.T) {
	pinyins := pinyin.Gains("你好噢")
	t.Log(pinyin.ToStringTone(pinyins, ""))
	t.Log(pinyin.ToStringTone(pinyins))
	t.Log(pinyin.ToStringTone(pinyins, ","))
	t.Log(pinyin.ToStringTone(pinyins, "-"))
}